app/views/inspirations/edit.html.erb


<% i = Inspiration.find_by(id: params["id"]) %>
---
SELECT  "inspirations".* FROM "inspirations" WHERE "inspirations"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]