app/views/inspirations/index.html.erb

</p>
<% Inspiration.all.each do |piece| %>
---
SELECT "inspirations".* FROM "inspirations"