app/views/inspirations/show.html.erb

<% i = Inspiration.find_by(id: params["id"]) %>
---
SELECT  "inspirations".* FROM "inspirations" WHERE "inspirations"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]