app/views/designs/edit.html.erb


  <% interior = Design.find_by(id: params["id"]) %>
---
SELECT  "designs".* FROM "designs" WHERE "designs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]