app/views/designs/index.html.erb

<div class="row">
  <% Design.all.each do |example| %>
---
SELECT "designs".* FROM "designs"