app/views/designs/show.html.erb

SELECT  "designs".* FROM "designs" WHERE "designs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
<% interior = Design.find_by(id: params["id"]) %>