app/views/fashions/edit.html.erb


<% f = Fashion.find_by(id: params["id"]) %>
---
SELECT  "fashions".* FROM "fashions" WHERE "fashions"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]