app/views/fashions/index.html.erb

<div class="row">
  <% Fashion.all.each do |piece| %>
---
SELECT "fashions".* FROM "fashions"