app/views/fashions/show.html.erb

SELECT  "fashions".* FROM "fashions" WHERE "fashions"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
<% f = Fashion.find_by(id: params["id"]) %>