app/controllers/art_controller.rb

INSERT INTO "arts" ("piece_name", "price", "inspiration_link", "size", "image_file", "created_at", "updated_at", "art_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    Art.create :art_type => params["art_type"],
                 :piece_name => params["piece_name"],
                 :price => params["price"],
                 :inspiration_link => params["inspiration_link"],
                 :size => params["size"],
                 :image_file => params["image_file"]

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "arts" SET "inspiration_link" = ?, "size" = ?, "updated_at" = ? WHERE "arts"."id" = ?  [["inspiration_link", ""], ["size", "0"], ["updated_at", "2018-02-19 18:37:55.568134"], ["id", 21]]
---
  def update
    art = Art.find_by(id: params["id"])
    art.art_type = params["art_type"]
    art.piece_name = params["piece_name"]
    art.price = params["price"]
    art.inspiration_link = params["inspiration_link"]
    art.size = params["size"]
    art.image_file = params["image_file"]
    art.save

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "arts" WHERE "arts"."id" = ?  [["id", 10]]
---
  def destroy
    art = Art.find_by(id: params["id"])
    art.delete