app/controllers/designs_controller.rb

SELECT  "designs".* FROM "designs" WHERE "designs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def update
    project = Design.find_by(id: params["id"])

SELECT  "designs".* FROM "designs" WHERE "designs"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
DELETE FROM "designs" WHERE "designs"."id" = ?  [["id", 37]]
---
  def destroy
    project = Design.find_by(id: params["id"])
    project.delete