app/controllers/fashions_controller.rb

  def update
    fashion = Fashion.find_by(id: params["id"])
---
SELECT  "fashions".* FROM "fashions" WHERE "fashions"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]