app/controllers/inspirations_controller.rb

  def create
    Inspiration.create :image_file => params["image_file"],
                 :blog_title=> params["blog_title"],
                 :date_posted=> params["date_posted"],
                 :inspo_reason=> params["inspo_reason"]
---
INSERT INTO "inspirations" ("blog_title", "date_posted", "created_at", "updated_at", "inspo_reason", "image_file") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    i = Inspiration.find_by(id: params["id"])
    i.delete
---
SELECT  "inspirations".* FROM "inspirations" WHERE "inspirations"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "inspirations" WHERE "inspirations"."id" = ?  [["id", 16]]