app/controllers/intros_controller.rb

SELECT  "arts".* FROM "arts" WHERE "arts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "designs".* FROM "designs" WHERE "designs"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
def index
  @art = Art.find_by(id: params["id"])
  @design = Design.find_by(id: params["id"])