app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY email
---
  def index
    @users = User.all.order('email')

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$uIeK6z6y1IAR/hUzj.UR2u.rRHdG4Q8ruBGublfzCByXXIbo69fIy"], ["updated_at", "2018-03-08 21:15:21.554322"], ["id", 1]]
---
  def update
    user = User.find_by(id: params["id"])
    user.email = params["email"]
    user.password = params["password"]
    user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    user = User.find_by(id: params["id"])
    user.delete

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest", "name") VALUES (?, ?, ?, ?, ?)
---
  def create # POST /users
    @user = User.new
    @user.name = params["name"]
    @user.email = params["email"]
    @user.password = params["password"]

    if @user.save