app/views/art/edit.html.erb

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---

<% art = Art.find_by(id: params["id"]) %>