app/views/art/index.html.erb

SELECT "arts".* FROM "arts"
---

  <% Art.all.each do |piece| %>