app/views/art/show.html.erb

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
<% artPiece = Art.find_by(id: params["id"]) %>