app/views/intros/index.html.erb

SELECT  "arts".* FROM "arts" ORDER BY "arts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
      <p>
        <% image_f = Art.last.image_file %>

SELECT  "designs".* FROM "designs" ORDER BY "designs"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
      <p>
        <% image_f = (Design.last.image_file) %>

SELECT  "fashions".* FROM "fashions" ORDER BY "fashions"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
      <p>
        <% image_f = (Fashion.last.image_file) %>

SELECT  "inspirations".* FROM "inspirations" ORDER BY "inspirations"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
      <div class="col-md-6 px-0">
        <% postTitle=Inspiration.last.blog_title %>